export const TEXT_DATA = {
  text: '请输入内容',
  color: '#000000',
  fontSize: 12,
  fontFamily: 'ZCOOL QingKe HuangYou',
  bold: false,
  textAlign: 'left',
};

export const IMAGE_DATA = {
  imgUrl: 'https://github.com/cadben/images_store/blob/master/img/4YT4k5.png?raw=true',
  showType: 'full',
};

export const BAR_CHART_DATA = {
  title: 'ECharts 入门示例',
  // chartData: [
  //   {
  //     数据: '52',
  //     类型: '上海销量',
  //     名称: '手机',
  //   },
  //   {
  //     数据: '220',
  //     类型: '上海销量',
  //     名称: '电脑',
  //   },
  //   {
  //     数据: '120',
  //     类型: '上海销量',
  //     名称: '笔',
  //   },
  //   {
  //     数据: '120',
  //     类型: '上海销量',
  //     名称: '书本',
  //   },
  //   {
  //     数据: '120',
  //     类型: '上海销量',
  //     名称: '衣服',
  //   },
  //   {
  //     数据: '125',
  //     类型: '杭州销量',
  //     名称: '手机',
  //   },
  //   {
  //     数据: '120',
  //     类型: '杭州销量',
  //     名称: '电脑',
  //   },
  //   {
  //     数据: '150',
  //     类型: '杭州销量',
  //     名称: '笔',
  //   },
  //   {
  //     数据: '110',
  //     类型: '杭州销量',
  //     名称: '书本',
  //   },
  //   {
  //     数据: '110',
  //     类型: '杭州销量',
  //     名称: '衣服',
  //   },
  // ],
  chartJsonData: [
    {
      数据: '52',
      类型: '上海销量',
      名称: '手机',
    },
    {
      数据: '220',
      类型: '上海销量',
      名称: '电脑',
    },
    {
      数据: '120',
      类型: '上海销量',
      名称: '笔',
    },
    {
      数据: '120',
      类型: '上海销量',
      名称: '书本',
    },
    {
      数据: '120',
      类型: '上海销量',
      名称: '衣服',
    },
    {
      数据: '125',
      类型: '杭州销量',
      名称: '手机',
    },
    {
      数据: '120',
      类型: '杭州销量',
      名称: '电脑',
    },
    {
      数据: '150',
      类型: '杭州销量',
      名称: '笔',
    },
    {
      数据: '110',
      类型: '杭州销量',
      名称: '书本',
    },
    {
      数据: '110',
      类型: '杭州销量',
      名称: '衣服',
    },
  ],
};

export const TABLE_DATA = {
  title: 'ECharts 入门示例',
  getDataType: 'static',
  tableData: [{
    date: '2016-05-02',
    name: '王小虎',
    address: '上海市普陀区金沙江路 1518 弄',
  }, {
    date: '2016-05-04',
    name: '王小虎',
    address: '上海市普陀区金沙江路 1517 弄',
  }, {
    date: '2016-05-01',
    name: '王小虎',
    address: '上海市普陀区金沙江路 1519 弄',
  }, {
    date: '2016-05-03',
    name: '王小虎',
    address: '上海市普陀区金沙江路 1516 弄',
  }],
  tableDataUrl: 'http://is.snssdk.com/api/news/feed/v51/',
};

export const LINE_DATA = {
  title: 'ECharts 入门示例',
  chartJsonData: [
    {
      数据: '52',
      类型: '上海销量',
      名称: '手机',
    },
    {
      数据: '220',
      类型: '上海销量',
      名称: '电脑',
    },
    {
      数据: '120',
      类型: '上海销量',
      名称: '笔',
    },
    {
      数据: '120',
      类型: '上海销量',
      名称: '书本',
    },
    {
      数据: '120',
      类型: '上海销量',
      名称: '衣服',
    },
    {
      数据: '125',
      类型: '杭州销量',
      名称: '手机',
    },
    {
      数据: '120',
      类型: '杭州销量',
      名称: '电脑',
    },
    {
      数据: '150',
      类型: '杭州销量',
      名称: '笔',
    },
    {
      数据: '110',
      类型: '杭州销量',
      名称: '书本',
    },
    {
      数据: '110',
      类型: '杭州销量',
      名称: '衣服',
    },
  ],
};
